
&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ПустаяДата = Дата(1, 1, 1);
	Если (ДатаНачала <> ПустаяДата) И (ДатаОкончания <> ПустаяДата) И (ДатаОкончания >= ДатаНачала) Тогда
		ЗаполнитьСервер();
	Иначе
		Предупреждение("Неверный диапазон");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГрафик(Команда)
	Если Вопрос("Очистить график " + Объект.Наименование + "?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОчиститьСервер();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	НомерПервогоДня = ДеньНедели(ДатаНачала);
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСервер()
	РеквизитФормыВЗначение(ОсновнойРеквизит()).ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, НомерПервогоДня);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСервер()
	РеквизитФормыВЗначение(ОсновнойРеквизит()).ОчиститьГрафик();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОсновнойРеквизит()
	Возврат "Объект";
КонецФункции
