
&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОсновныеНачисленияВидРасчетаПриИзмененииНаСервере(Размер)
    Размер = Константы.ШтрафЗаПрогул.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияВидРасчетаПриИзменении(Элемент)
    ТекСтр = Элементы.ОсновныеНачисления.ТекущиеДанные;
    
    Если ТекСтр.ВидРасчета.Наименование = "ШтрафЗаПрогул" Тогда 
        ОсновныеНачисленияВидРасчетаПриИзмененииНаСервере(ТекСтр.Размер);	
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОсновныеНачисленияПериодДействияКонецПриИзмененииНаСервере() 
    ИдентификаторСтроки = Элементы.ОсновныеНачисления.ТекущаяСтрока;
    ТекСтр = Объект.ОсновныеНачисления.НайтиПоИдентификатору(ИдентификаторСтроки);
    
    ПериодДействияНачало = ТекСтр.ПериодДействияНачало;
    ПериодДействияКонец = ТекСтр.ПериодДействияКонец;
    
    Если Месяц(ПериодДействияНачало) = Месяц(ПериодДействияКонец) Тогда
        Возврат;                                                                                         
    КонецЕсли;                                                                   
    
    // конец периода действия текущей строки
    ТекСтр.ПериодДействияНачало = ПериодДействияНачало;
    ТекСтр.ПериодДействияКонец = КонецМесяца(ПериодДействияНачало);
    
    Для Счетчик = Месяц(ПериодДействияНачало) По Месяц(ПериодДействияКонец) Цикл
        // если это первый месяц периода
        Если Счетчик = Месяц(ПериодДействияНачало) Тогда
            Продолжить;    
        КонецЕсли;
        
        
        НовСтр = Объект.ОсновныеНачисления.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
        
        ТекущийГод = Формат(Год(ТекущаяДата()), "ЧГ=");
        ТекущийМесяц = ?(СтрДлина(Строка(Счетчик)) = 1, "0", "") + Строка(Счетчик);
        
        НовСтр.ПериодДействияНачало = НачалоМесяца(Дата(ТекущийГод + ТекущийМесяц + "01"));
        НовСтр.ПериодДействияКонец = КонецМесяца(Дата(ТекущийГод + ТекущийМесяц + "01"));
        
        
        // если это последний месяц периода
        Если Счетчик = Месяц(ПериодДействияКонец) Тогда
            НовСтр.ПериодДействияКонец = ПериодДействияКонец;    
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияПериодДействияКонецПриИзменении(Элемент)
    ОсновныеНачисленияПериодДействияКонецПриИзмененииНаСервере();
КонецПроцедуры
